stm32-rs/stm32f4xx-hal/src/timer.rs
        pwm_pin!($TIM, C1, ccr1, 0);
        pwm_pin!($TIM, C2, ccr2, 4);
    };
    ($TIM:ty: CH4 $(, $aoe:ident)?) => {
        impl WithPwm for $TIM {
            const CH_NUMBER: u8 = 4;

            #[inline(always)]
            fn read_cc_value(&self, channel: Channel) -> Self::Width {
                let ccr = match channel {
                    Channel::C1 => {
                        &self.ccr1
                    }
                    Channel::C2 => {
                        &self.ccr2
                    }
                    Channel::C3 => {
                        &self.ccr3
                    }
                    Channel::C4 => {
                        &self.ccr4
                    }
                };
                ccr.read().bits() as Self::Width
            }

            #[inline(always)]
            fn set_cc_value(&mut self, channel: Channel, value: Self::Width) {
                let ccr = match channel {
                    Channel::C1 => {
                        &self.ccr1
                    }
                    Channel::C2 => {
                        &self.ccr2
                    }
                    Channel::C3 => {
                        &self.ccr3
                    }
                    Channel::C4 => {
                        &self.ccr4
                    }
                };
                ccr.write(|w| unsafe { w.bits(value as u32) })
            }

            #[inline(always)]
            fn preload_output_channel_in_mode(&mut self, channel: Channel, mode: Ocm) {
                match channel {
                    Channel::C1 => {
                        self.ccmr1_output()
                        .modify(|_, w| w.oc1pe().set_bit().oc1m().bits(mode as _) );
                    }
                    Channel::C2 => {
                        self.ccmr1_output()
                        .modify(|_, w| w.oc2pe().set_bit().oc2m().bits(mode as _) );
                    }
                    Channel::C3 => {
                        self.ccmr2_output()
                        .modify(|_, w| w.oc3pe().set_bit().oc3m().bits(mode as _) );
                    }
                    Channel::C4 => {
                        self.ccmr2_output()
                        .modify(|_, w| w.oc4pe().set_bit().oc4m().bits(mode as _) );
                    }
                }
            }

            #[inline(always)]
            fn start_pwm(&mut self) {
                $(let $aoe = self.bdtr.modify(|_, w| w.aoe().set_bit());)?
                self.cr1.write(|w| w.cen().set_bit());
            }

            #[inline(always)]
            fn enable_channel(&mut self, channel: Channel, b: bool) {
                let c = channel as u8;
                if c < Self::CH_NUMBER {
                    if b {
                        unsafe { bb::set(&self.ccer, c*4) }
                    } else {
                        unsafe { bb::clear(&self.ccer, c*4) }
                    }
                }
            }
        }

        pwm_pin!($TIM, C1, ccr1, 0);
        pwm_pin!($TIM, C2, ccr2, 4);
        pwm_pin!($TIM, C3, ccr3, 8);
        pwm_pin!($TIM, C4, ccr4, 12);
    }
}

impl<TIM> CountDownTimer<TIM>
where
    TIM: General,
{
    /// Starts listening for an `event`
    ///
    /// Note, you will also have to enable the TIM2 interrupt in the NVIC to start
    /// receiving events.
    pub fn listen(&mut self, event: Event) {
        self.tim.listen_interrupt(event, true);
    }

    /// Clears interrupt associated with `event`.
    ///
    /// If the interrupt is not cleared, it will immediately retrigger after
    /// the ISR has finished.
    pub fn clear_interrupt(&mut self, event: Event) {
        self.tim.clear_interrupt_flag(event);
    }

    /// Stops listening for an `event`
    pub fn unlisten(&mut self, event: Event) {
        self.tim.listen_interrupt(event, false);
    }

    /// Releases the TIM peripheral
    pub fn release(mut self) -> TIM {
        // pause counter
        self.tim.disable_counter();
        self.tim
    }
}

#[inline(always)]
pub(crate) const fn compute_arr_presc(freq: u32, clock: u32) -> (u16, u32) {
    let ticks = clock / freq;
    let psc_u32 = (ticks - 1) / (1 << 16);
    let psc = if psc_u32 > u16::MAX as u32 {
        panic!();
    } else {
        psc_u32 as u16
    };
    let arr = ticks / (psc_u32 + 1) - 1;
    (psc, arr)
}

impl<TIM> CountDown for CountDownTimer<TIM>
where
    TIM: General,
{
    type Time = Hertz;

    fn start<T>(&mut self, timeout: T)
    where
        T: Into<Self::Time>,
    {
        // pause
        self.tim.disable_counter();
        // reset counter
        self.tim.reset_counter();

        let (psc, arr) = compute_arr_presc(timeout.into().0, self.clk.0);
        self.tim.set_prescaler(psc);
        self.tim.set_auto_reload(arr).unwrap();

        // Trigger update event to load the registers
        self.tim.trigger_update();

        // start counter
        self.tim.enable_counter();
    }

    fn wait(&mut self) -> nb::Result<(), Void> {
        if self.tim.get_interrupt_flag().contains(Event::Update) {
            self.tim.clear_interrupt_flag(Event::Update);
            Ok(())
        } else {
            Err(nb::Error::WouldBlock)
        }
    }
}

impl<TIM> Cancel for CountDownTimer<TIM>
where
    TIM: General,
{
    type Error = Error;

    fn cancel(&mut self) -> Result<(), Self::Error> {
        if !self.tim.is_counter_enabled() {
            return Err(Self::Error::Disabled);
        }

        // disable counter
        self.tim.disable_counter();
        Ok(())
    }
}

// All F4xx parts have these timers.
hal!(
    pac::TIM1: [Timer1, u16, CH4, _aoe],
    pac::TIM9: [Timer9, u16, CH2],
    pac::TIM11: [Timer11, u16, CH1],
);

// All parts except for F410 add these timers.
#[cfg(not(feature = "stm32f410"))]
hal!(
    pac::TIM5: [Timer5, u32, CH4],
    pac::TIM2: [Timer2, u32, CH4],
    pac::TIM3: [Timer3, u16, CH4],
    pac::TIM4: [Timer4, u16, CH4],
    pac::TIM10: [Timer10, u16, CH1],
);

// TIM5 on F410 is 16-bit
#[cfg(feature = "stm32f410")]
hal!(pac::TIM5: [Timer5, u16, CH4],);

